<script setup lang="ts">
import { generatePageTitle } from "@/utils/seo";

const route = useRoute();

const pageTitie = generatePageTitle("Політика використання файлів Cookie");
const pageDescription = "Політика використання файлів Cookie";

useSeoMeta({
  title: pageTitie,
  description: pageDescription,
  ogTitle: pageTitie,
  ogUrl: route.fullPath,
  ogImage: {
    url: "/bycar-logo-light.png",
    alt: pageTitie,
  },
  ogDescription: pageDescription,
});

useHead({
  script: [
    {
      type: "application/ld+json",
      innerHTML: JSON.stringify(
        generateBreadcrumbsJsonLd([{ name: pageTitie, path: route.fullPath }]),
      ),
    },
  ],
});
</script>

<template>
  <main class="container pt-24 md:pt-32 pb-5 prose xl:prose-xl">
    <h1 class="text-center">Політика використання файлів Cookie</h1>
    <p>
      Як і багато інших компаній, БАЙКАР ЮКРЕЙН використовує технологію cookies.
    </p>

    <h3>Що таке - фали Cookie?</h3>
    <p>
      Файл cookie - це невеликий фрагмент даних, який зберігається сайтом,
      додатком чи іншою платформою на вашому комп'ютері, планшеті, смартфоні або
      іншому девайсі і який містить інформацію про вашу історії переглядів,
      налаштувань або використання сайту. Хоча в цій Політиці ми і
      використовуємо загальний термін "файли cookie", оскільки їх застосування є
      основним методом зберігання інформації, що використовується на нашому
      сайті bycar.in.ua, ми також використовуємо з тією ж метою "локальне
      сховище" браузера, веб-маяки, пікселі відстеження. Вся інформація в цьому
      розділі також стосується зазначених та інших подібних інструментів.
    </p>
    <p>
      В цілому файли cookie допомагають нам надавати вам кращий веб-сайт,
      дозволяючи відслідковувати, які сторінки ви знаходите корисними, а які ні.
      Файл cookie жодним чином не дає нам доступу до вашого комп’ютера або
      будь-якої інформації про вас, крім даних, якими ви хочете поділитися з
      нами. Ви можете прийняти або відхилити кукі.
    </p>

    <p>Файли cookie використовуються, щоб:</p>
    <ul>
      <li>розуміти, що сайт працює належним чином;</li>
      <li>
        запам’ятовувати налаштування користувачів під час і між відвідинами;
      </li>
      <li>
        користувачі могли взаємодіяти з сайтом, залишаючи коментарі або
        заповнюючи форми;
      </li>
      <li>
        надавати статистику для аналізу, щоб зробити сайт зручним, швидким і
        безпечним.
      </li>
    </ul>

    <p>Файли cookie не використовуються, щоб:</p>
    <ul>
      <li>
        збирати будь-яку особисту інформацію, що дозволяє встановити особу (без
        вашого явного дозволу);
      </li>
      <li>
        збирати будь-яку конфіденційну інформацію (без вашого явного дозволу);
      </li>
      <li>передавати особисті дані третім особам.</li>
    </ul>

    <p>
      БАЙКАР ЮКРЕЙН використовує Google Analytics (Google Inc). Сайт
      використовує файли cookie, що зберігаються на пристрої користувача, і
      відправляє дані, які будуть зберігатися на серверах Google. Цей процес
      дозволяє отримати доступ до статистики сайту БАЙКАР ЮКРЕЙН і
      проаналізувати поведінку користувачів. Завдяки цим діям може оптимізувати
      роботу веб-сайту і пропонувати високу якість послуг. Ми не передаємо
      особисті дані в Google Inc., і єдиними файлами, якими володіє ТОВ "БАЙКАР
      ЮКРЕЙН", є файли cookie, що стосуються використання веб-сайту
      користувачами. Google Analytics використовується тільки для статистичних
      та аналітичних цілей.
    </p>

    <h3>Які файли cookie використовує сайт БАЙКАР ЮКРЕЙН</h3>
    <p>
      На нашому веб-сайті встановлена служба Google Analytics, яка дозволяє нам
      відстежувати і складати статистику анонімних відвідувачів. Зібрана
      інформація варіюється від простого обсягу трафіку до типу браузера, за
      допомогою якого ви переглядаєте наш веб-сайт.
    </p>

    <h3>Як відключити кукі</h3>
    <p>
      Більшість сучасних браузерів дозволяють вам управляти настройками файлів
      cookie для всіх веб-сайтів, які ви переглядаєте. Ви можете повністю
      відключити файлі cookie, відредагувавши налаштування свого браузера, однак
      при цьому ви можете обмежити функціональність, що відображається на нашому
      веб-сайті. Щоб дізнатися, як відключити файли cookie в улюбленому вами
      браузері, ми рекомендуємо прочитати цю
      <a href="https://support.google.com/accounts/answer/61416?hl=en">
        пораду Google </a>. Ви також можете відключити Google Analytics на всіх веб-сайтах,
      завантаживши
      <a href="https://tools.google.com/dlpage/gaoptout">
        програму для браузера для відключення Google Analytics </a>.
    </p>

    <JurCreds />
  </main>
</template>
