<script setup lang="ts">
import { generatePageTitle } from "@/utils/seo";

const route = useRoute();

const pageTitie = generatePageTitle("Політика конфіденційності");
const pageDescription =
  'Угода та правила використання веб-сайту розроблені і прийняті ТОВ "БАЙКАР ЮКРЕЙН"';

useSeoMeta({
  title: pageTitie,
  description: pageDescription,
  ogTitle: pageTitie,
  ogUrl: route.fullPath,
  ogImage: {
    url: "/bycar-logo-light.png",
    alt: pageTitie,
  },
  ogDescription: pageDescription,
});

useHead({
  script: [
    {
      type: "application/ld+json",
      innerHTML: JSON.stringify(
        generateBreadcrumbsJsonLd([{ name: pageTitie, path: route.fullPath }]),
      ),
    },
  ],
});
</script>

<template>
  <main class="container pt-24 md:pt-32 pb-5 prose lg:prose-xl">
    <h1 class="text-center">
      Політика конфіденційності
    </h1>

    <h3>Права сторін</h3>
    <p>
      Уважно прочитайте Угоду перед використанням веб-сайту bycar.in.ua.
      Використовуючи веб-сайт ви автоматично погоджуєтеся з положеннями,
      зазначеними нижче і зобов’язані дотримуватися умов цієї Угоди. Якщо ви не
      згодні з правилами використання, будь ласка, не використовуйте веб-сайт, а
      також не відвідуйте сторінки, розміщені в доменній зоні веб-сайту.
    </p>
    <p>
      Угода та правила використання веб-сайту розроблені і прийняті ТОВ "БАЙКАР
      ЮКРЕЙН", щоб захистити права, що охороняються законом, та інтереси як ТОВ
      "БАЙКАР ЮКРЕЙН", так і третіх осіб при наданні послуг. Приєднуючись до
      цієї Угоди і залишаючи свої дані у формах заповнення на веб-сайті
      bycar.in.ua, ви:
    </p>
    <ul>
      <li>підтверджуєте, що всі зазначені дані належать особисто вам;</li>
      <li>
        підтверджуєте та визнаєте, що уважно вивчили умови обробки персональних
        даних, які залишаєте в полях форм;
      </li>
      <li>даєте згоду на обробку особистих даних на веб-сайті bycar.in.ua;</li>
      <li>висловлює згоду з умовами обробки персональних даних.</li>
      <li>
        Метою обробки персональних даних є надання вам послуг, описаних на
        веб-сайті.
      </li>
    </ul>

    <h3>Що ми робимо з зібраною інформацією</h3>
    <p>
      Збір, систематизація, накопичення, зберігання, уточнення (оновлення,
      зміну), використання, знеособлення, передача третім особам для зазначених
      нижче цілей, а також здійснення будь-яких інших дій, як не
      автоматизованими, так і автоматизованими способами — це те, що компанія
      робить з отриманою інформацією. Ми зберігаємо конфіденційність інформації
      користувачів, крім випадків добровільного надання користувачем інформації
      про себе для доступу третіх осіб. Ваша інформація також зберігається в
      CRM-системі для внутрішнього обліку, якщо ви залишаєте заявку, щоб стати
      бізнес-партнером або клієнтом. Інформація необхідна нам, щоб зрозуміти
      ваші потреби і надати додаткову інформацію про запитані вами продукти та
      послуги.
    </p>
    <p>
      Ми можемо використовувати цю інформацію для поліпшення наших продуктів і
      послуг. Ми також використовуємо вашу інформацію для аналізу вашої
      взаємодії з нашим сайтом і його ефективності, наприклад, того, скільки
      часу відвідувачі провели на веб-сайті, для нашої дослідницької діяльності
      і для збору демографічної інформації про нашу користувацьку базу. Ми
      можемо періодично відправляти рекламні електронні листи про нові продукти,
      спеціальні пропозиції або іншу інформацію, яка, на нашу думку, може вас
      зацікавити, на адресу електронної пошти, яку ви вказали. Час від часу ми
      також можемо використовувати вашу інформацію, щоб зв'язатися з вами з
      метою дослідження ринку.
    </p>

    <h3>
      Компанія має право передати вашу інформацію третім особам в наступних
      випадках:
    </h3>
    <ul>
      <li>Ви погоджуєтесь на такі дії;</li>
      <li>
        Передача необхідна в рамках надання компанією послуг користувачеві. Ми
        розкриваємо вашу інформацію третім особам, які надають послуги від
        нашого імені. Наприклад, підрядникам, які публікують контент наших
        клієнтів на маркетингових платформах;
      </li>
      <li>
        Ми також зобов’язані розкрити вашу інформацію в зв’язку з запитами
        місцевих, державних органів влади або правоохоронних органів; в зв’язку
        з судовим, адміністративним або аналогічним виробництвом або постановою,
        повісткою до суду; для розслідування підозр у шахрайстві, домаганнях,
        фізичних погроз або інших порушень закону, правил або інших постанов;
      </li>
      <li>
        Тією ж мірою, в якій це дозволено законодавством, ми можемо збирати
        інформацію, яка не є особистою інформацією, наприклад, сукупні дані і
        іншу узагальнену інформацію, включаючи інформацію про перегляди сторінок
        веб-сайту, використання та взаємодіях на веб-сайті, а також знеособлену
        інформацію.
      </li>
    </ul>

    <h3>Захист особистих даних</h3>
    <p>
      Ми приймаємо необхідні і достатні організаційні та технічні заходи для
      захисту інформації користувачів від неправомірного або випадкового
      доступу, знищення, перекручення, блокування, копіювання, поширення, а
      також від інших неправомірних дій третіх осіб.
    </p>
    <p>
      Ми не передаємо вашу особисту інформацію третім особам без вашої згоди.
      Якщо ви вважаєте, що будь-яка інформація, яку ми зберігаємо про вас,
      невірна або неповна, напишіть нам email або лист якомога швидше. Ми
      негайно виправимо будь-яку інформацію, яка виявилась невірною. Ми
      приймаємо повідомлення на адресу електронної пошти bycar.in.ua@gmail.com,
      або за адресою: 03035, місто Київ, вулиця Монастирського Дениса, будинок
      3, кабінет 610
    </p>

    <h3>Відмова від участі і відкликання згоди</h3>
    <p>
      Ні в якому разі, включаючи, але не обмежуючись недбалим ставленням, ТОВ
      "БАЙКАР ЮКРЕЙН" не несе відповідальності за будь-які прямі або непрямі
      збитки, спричинені використанням даного сайту або неможливістю його
      використання.
    </p>

    <p>
      Вебсайт bycar.in.ua є інформаційною онлайн-платформою, яка надає
      користувачам доступ до каталогу автомобілів, представлених офіційними
      дилерами, імпортерами та іншими партнерами.
    </p>

    <p>Ми не є продавцем чи постачальником транспортних засобів.</p>

    <p>
      Уся інформація про автомобілі (включаючи ціни, технічні характеристики,
      наявність, комплектації тощо) надана партнерами або взята з відкритих
      джерел та публікується виключно в ознайомлювальних цілях. ТОВ "БАЙКАР
      ЮКРЕЙН" не несе відповідальності за достовірність, повноту або
      актуальність такої інформації.
    </p>

    <p>
      Фінальні умови продажу, наявність автомобілів, ціни та комплектації слід
      уточнювати безпосередньо у продавців.
    </p>

    <p>
      Використовуючи сайт, ви погоджуєтесь, що ТОВ "БАЙКАР ЮКРЕЙН" не несе
      відповідальності за будь-які прямі чи непрямі збитки, спричинені
      використанням або неможливістю використання опублікованої інформації.
    </p>

    <h3>Ми відповідаємо на питання</h3>
    <p>
      Якщо у вас є які-небудь питання про цю Політику конфіденційності, практики
      цього сайту або ваші відносини з цим сайтом, питання, пов’язані з
      порушенням авторських прав, незаконного використання матеріалів
      інтернет-сайту або розміщенням неправдивої, що вводить в оману, інформації
      про компанію, будь ласка, зв’яжіться з нами за адресою:
    </p>

    <JurCreds />
  </main>
</template>
