<script setup lang="ts">
import { generatePageTitle } from "@/utils/seo";

useHead({
  title: generatePageTitle("Політика приватності"),
  meta: [
    {
      name: "description",
      content:
        "Політика приватності | bycar-in-ua - Автомобільна спільнота України",
    },
    {
      name: "og:title",
      content: generatePageTitle("Політика приватності"),
    },
    {
      name: "og:url",
      content: "https://bycar.in.ua/privacy",
    },
    {
      name: "og:image",
      content: "/public/images/homepage-bg.jpg", // TODO
    },
  ],
});
</script>

<template>
  <main class="container pt-24 md:pt-32 pb-5 prose lg:prose-xl">
    <h1>Політика приватності</h1>

    <h3>Права сторін</h3>
    <p>
      Уважно прочитайте Угоду перед використанням веб-сайту bycar.in.ua.
      Використовуючи веб-сайт ви автоматично погоджуєтеся з положеннями,
      зазначеними нижче і зобов’язані дотримуватися умов цієї Угоди. Якщо ви не
      згодні з правилами використання, будь ласка, не використовуйте веб-сайт, а
      також не відвідуйте сторінки, розміщені в доменній зоні веб-сайту.
    </p>
    <p>
      Угода та правила використання веб-сайту розроблені і прийняті ТОВ "БАЙКАР
      ЮКРЕЙН", щоб захистити права, що охороняються законом, та інтереси як ТОВ
      "БАЙКАР ЮКРЕЙН", так і третіх осіб при наданні послуг. Приєднуючись до
      цієї Угоди і залишаючи свої дані у формах заповнення на веб-сайті
      bycar.in.ua, ви:
    </p>
    <ul>
      <li>підтверджуєте, що всі зазначені дані належать особисто вам;</li>
      <li>
        підтверджуєте та визнаєте, що уважно вивчили Угода та умови обробки
        персональних даних, які залишаєте в полях форм;
      </li>
      <li>даєте згоду на обробку особистих даних на веб-сайті bycar.in.ua;</li>
      <li>висловлює згоду з умовами обробки персональних даних.</li>
      <li>
        Метою обробки персональних даних є надання вам послуг, описаних на
        веб-сайті.
      </li>
    </ul>

    <h3>Що ми робимо з зібраною інформацією</h3>
    <p>
      Збір, систематизація, накопичення, зберігання, уточнення (оновлення,
      зміну), використання, знеособлення, передача третім особам для зазначених
      нижче цілей, а також здійснення будь-яких інших дій, як не
      автоматизованими, так і автоматизованими способами — це те, що компанія
      робить з отриманої інформацією. Ми зберігаємо конфіденційність інформації
      користувачів, крім випадків добровільного надання користувачем інформації
      про себе для доступу третіх осіб. Ваша інформація також зберігається в
      CRM-системі для внутрішнього обліку, якщо ви залишаєте заявку, щоб стати
      бізнес-партнером або клієнтом. Інформація необхідна нам, щоб зрозуміти
      ваші потреби і надати додаткову інформацію про запитані вами продукти та
      послуги.
    </p>
    <p>
      Ми можемо використовувати цю інформацію для поліпшення наших продуктів і
      послуг. Ми також використовуємо вашу інформацію для аналізу вашої
      взаємодії з нашим сайтом і його ефективності, наприклад, того, скільки
      часу відвідувачі провели на веб-сайті, для нашої дослідницької діяльності
      і для збору демографічної інформації про нашу користувацьку базу. Ми
      можемо періодично відправляти рекламні електронні листи про нові продукти,
      спеціальні пропозиції або іншу інформацію, яка, на нашу думку, може вас
      зацікавити, на адресу електронної пошти, яку ви вказали. Час від часу ми
      також можемо використовувати вашу інформацію, щоб зв'язатися з вами з
      метою дослідження ринку.
    </p>

    <h3>
      Компанія має право передати вашу інформацію третім особам в наступних
      випадках:
    </h3>
    <ul>
      <li>Ви погоджуєтесь на такі дії.</li>
      <li>
        Передача необхідна в рамках надання компанією послуг користувачеві. Ми
        розкриваємо вашу інформацію третім особам, які надають послуги від
        нашого імені. Наприклад, підрядникам, які публікують контент наших
        клієнтів на маркетингових платформах.
      </li>
      <li>
        Ми також зобов’язані розкрити вашу інформацію в зв’язку з запитами
        місцевих, державних органів влади або правоохоронних органів; в зв’язку
        з судовим, адміністративним або аналогічним виробництвом або постановою,
        повісткою до суду; для розслідування підозр у шахрайстві, домаганнях,
        фізичних погроз або інших порушень закону, правил або інших постанов.
      </li>
      <li>
        Тією ж мірою, в якій це дозволено законодавством, ми можемо збирати
        інформацію, яка не є особистою інформацією, наприклад, сукупні дані і
        іншу узагальнену інформацію, включаючи інформацію про перегляди сторінок
        веб-сайту, використання та взаємодіях на веб-сайті, а також знеособлену
        інформацію.
      </li>
    </ul>

    <h3>Захист особистих даних</h3>
    <p>
      Ми приймаємо необхідні і достатні організаційні та технічні заходи для
      захисту інформації користувачів від неправомірного або випадкового
      доступу, знищення, перекручення, блокування, копіювання, поширення, а
      також від інших неправомірних дій третіх осіб.
    </p>
    <p>
      Ми не передаємо вашу особисту інформацію третім особам без вашої згоди.
      Якщо ви вважаєте, що будь-яка інформація, яку ми зберігаємо про вас,
      невірна або неповна, напишіть нам email або лист якомога швидше. Ми
      негайно виправимо будь-яку інформацію, яка виявилась невірною. Ми
      приймаємо повідомлення на адресу електронної пошти bycar.in.ua@gmail.com,
      або за адресою: 03035, місто Київ, вулиця Монастирського Дениса, будинок
      3, кабінет 610
    </p>

    <h3>Політика cookie</h3>
    <p>
      Як і багато інших компаній, БАЙКАР ЮКРЕЙН використовує технологію cookies.
    </p>

    <h3>ЩО ТАКЕ - ФАЙЛИ COOKIE?</h3>
    <p>
      Файл cookie - це невеликий фрагмент даних, який зберігається сайтом,
      додатком чи іншою платформою на вашому комп'ютері, планшеті, смартфоні або
      іншому девайсі і який містить інформацію про вашу історії переглядів,
      налаштувань або використання сайту. Хоча в цій Політиці ми і
      використовуємо загальний термін "файли cookie", оскільки їх застосування є
      основним методом зберігання інформації, що використовується на нашому
      сайті bycar.in.ua, ми також використовуємо з тією ж метою "локальне
      сховище" браузера, веб-маяки, пікселі відстеження. Вся інформація в цьому
      розділі також стосується зазначених та інших подібних інструментів.
    </p>
    <p>
      В цілому файли cookie допомагають нам надавати вам кращий веб-сайт,
      дозволяючи відслідковувати, які сторінки ви знаходите корисними, а які ні.
      Файл cookie жодним чином не дає нам доступу до вашого комп’ютера або
      будь-якої інформації про вас, крім даних, якими ви хочете поділитися з
      нами. Ви можете прийняти або відхилити кукі.
    </p>

    <p>Файли cookie використовуються, щоб:</p>
    <ul>
      <li>розуміти, що сайт працює належним чином;</li>
      <li>
        запам’ятовувати налаштування користувачів під час і між відвідинами;
      </li>
      <li>
        користувачі могли взаємодіяти з сайтом, залишаючи коментарі або
        заповнюючи форми;
      </li>
      <li>
        надавати статистику для аналізу, щоб зробити сайт зручним, швидким і
        безпечним.
      </li>
    </ul>

    <p>Файли cookie не використовуються, щоб:</p>
    <ul>
      <li>
        збирати будь-яку особисту інформацію, що дозволяє встановити особу (без
        вашого явного дозволу);
      </li>
      <li>
        збирати будь-яку конфіденційну інформацію (без вашого явного дозволу);
      </li>
      <li>передавати особисті дані третім особам.</li>
    </ul>

    <p>
      БАЙКАР ЮКРЕЙН використовує Google Analytics (Google Inc). Сайт
      використовує файли cookie, що зберігаються на пристрої користувача, і
      відправляє дані, які будуть зберігатися на серверах Google. Цей процес
      дозволяє отримати доступ до статистики сайту БАЙКАР ЮКРЕЙН і
      проаналізувати поведінку користувачів. Завдяки цим діям може оптимізувати
      роботу веб-сайту і пропонувати високу якість послуг. Ми не передаємо
      особисті дані в Google Inc., і єдиними файлами, якими володіє ТОВ "БАЙКАР
      ЮКРЕЙН", є файли cookie, що стосуються використання веб-сайту
      користувачами. Google Analytics використовується тільки для статистичних
      та аналітичних цілей.
    </p>

    <h3>Які файли cookie використовує сайт БАЙКАР ЮКРЕЙН</h3>
    <p>
      На нашому веб-сайті встановлена служба Google Analytics, Meta (Facebook)
      Pixel, LinkedIn Pixel, Quora Pixel, Reddit Pixel, TikTok Pixel, Plerdy,
      Hotjar, Double Click, вбудована аналітика WordPress і Contact Form7, яка
      дозволяє нам відстежувати і складати статистику анонімних відвідувачів.
      Зібрана інформація варіюється від простого обсягу трафіку до типу
      браузера, за допомогою якого ви переглядаєте наш веб-сайт.
    </p>

    <h3>Як відключити кукі</h3>
    <p>
      Більшість сучасних браузерів дозволяють вам управляти настройками файлів
      cookie для всіх веб-сайтів, які ви переглядаєте. Ви можете повністю
      відключити файлі cookie, відредагувавши налаштування свого браузера, однак
      при цьому ви можете обмежити функціональність, що відображається на нашому
      веб-сайті. Щоб дізнатися, як відключити файли cookie в улюбленому вами
      браузері, ми рекомендуємо прочитати цю пораду Google
      (https://support.google.com/accounts/answer/61416?hl=en). Ви також можете
      відключити Google Analytics на всіх веб-сайтах, завантаживши програму для
      браузера для відключення Google Analytics
      (https://tools.google.com/dlpage/gaoptout).
    </p>

    <h3>Відмова від участі і відкликання згоди</h3>
    <p>
      Ні в якому разі, включаючи, але не обмежуючись недбалим ставленням, ТОВ
      "БАЙКАР ЮКРЕЙН" не несе відповідальності за будь-які прямі або непрямі
      збитки, спричинені використанням даного сайту або неможливістю його
      використання.
    </p>

    <h3>Ми відповідаємо на питання</h3>
    <p>
      Якщо у вас є які-небудь питання про цю Політику конфіденційності, практики
      цього сайту або ваші відносини з цим сайтом, питання, пов’язані з
      порушенням авторських прав, незаконного використання матеріалів
      інтернет-сайту або розміщенням неправдивої, що вводить в оману, інформації
      про компанію, будь ласка, зв’яжіться з нами за адресою:
    </p>
    <p>
      ТОВ "БАЙКАР ЮКРЕЙН"<br />
      03035, місто Київ, вулиця Монастирського Дениса, будинок 3, кабінет 610<br />
      bycar.in.ua@gmail.com<br />
      +38 098 957 99 23
    </p>
  </main>
</template>
